let names = ["შოთა","მამუკა", "ლევან", "ლალი"]
if(names.length == 4 && names[3] == "ლალი"){
    console.log("მე მაწყობს ეს მასივი")
}else{
    console.log("მე არ მაწყობს ეს მასივი")
}

/* -------------------------------------------------------- */

// let names = ["შოთა ბერიძე", "მამუკა ლაღიძე", "ლევან ჯოხაძე", "ლალი სიხარულიძე", "ნინო გიორგაძე"]
// if (names.length >= 3){
//     console.log("ეს დიდი მასივია, რომელშიც მინიმუმ 3 ელემენტია")
// }else{
//     console.log("ეს პატარა მასივია და შედგება 3-ზე ნაკლები რაოდენობისე ელემენტებისაგან")
// }

/* -------------------------------------------------------- */

// const boys = ["შოთა", "მამუკა", "ლევან"]
// const girls = ["ლალი", "ია", "სოფო"]
// const all = boys.concat(girls)
// console.log(all)

/* -------------------------------------------------------- */

// const animals = ["ლომი", "ვეფხვი", "აფთარი", "ზღარბი", "კუ", "ზარმაცა"]
// animals.shift()
// animals.pop()
// console.log(animals)

/* -------------------------------------------------------- */

// let numbers = [3, 4, 6, 7, 9]
// let average = (numbers[0] + numbers[2] + numbers[4])/3
// console.log(average)

/* -------------------------------------------------------- */

// let even = []
// let odd = []
// let numbers = [110,29,38,47,56,65,74,83,92,101]
// for(var x = 0; x < numbers.length; x++){
//     if(numbers[x] % 2 == 0){
//         even.push(numbers[x])
//     }
//     else{
//         odd.push(numbers[x])
//     }
// }

// console.log("ლუწები: " + even)
// console.log("კენტები: " + odd)